Revit 2024 API
ParameterTypeId.LockedBaseOffset Property
 "Negative Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LockedBaseOffset { get; }
Visual Basic
Public Shared ReadOnly Property LockedBaseOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LockedBaseOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace